[
  {
    "id": 1,
    "blogimg": "/src/assets/img/Blogs1.png",
    "blogtitle": "Honoring Our Nation’s Heroes All Month Long",
    "blogtext": "Honoring Our Nation’s Heroes All Month Long May is National Military Appreciation Month, a time to recognize the courage, service, and sacrifice of the men and women who serve our country. At Kennedy Concrete, we are proud to honor our heroes throughout the entire month. This"
  },
  {
    "id": 2,
    "blogimg": "/src/assets/img/Blogs2.png",
    "blogtitle": "Kennedy Concrete Supplies Building Materials Online",
    "blogtext": "Kennedy Concrete Supplies Building Materials Online We’re committed to supporting your construction projects from the ground up. While we’re known for reliable concrete delivery, our services extend beyond that. You can now conveniently order concrete, block, and a wide range of building materials directly from our"
  },
  {
    "id": 3,
    "blogimg": "/src/assets/img/Blogs.png",
    "blogtitle": "2025 Building Materials Market Outlook",
    "blogtext": "2025 Building Materials Market Outlook At Kennedy Concrete, we are always looking ahead to better serve our customers. A recent report from FN Media Group via GlobeNewswire highlights cautious optimism for the building products sector heading into 2025. Following a year of strong foundational growth in"
  },
  {
    "id": 4,
    "blogimg": "/src/assets/img/Blog.jpg",
    "blogtitle": "Delivering Concrete for a 3D Printed Home",
    "blogtext": "Delivering Concrete for a 3D Printed Home At Kennedy Concrete, we’re proud to do more than just deliver concrete — we help power innovation in the construction industry. That’s why we were excited to support a groundbreaking project by supplying concrete for a 3D printed home."
  },
  {
    "id": 5,
    "blogimg": "/src/assets/img/Blogs5.png",
    "blogtitle": "Concrete Finishing Techniques on Plastic and Subgrade Surfaces",
    "blogtext": "The Impact of Substrate on Concrete Finishing The choice between pouring concrete on a plastic vapor barrier or directly onto subgrade significantly influences the finishing process. Each method affects moisture movement, setting times, and the overall quality of the finished surface. At Kennedy Concrete, we provide"
  },
  {
    "id": 6,
    "blogimg": "/src/assets/img/Blogs6.png",
    "blogtitle": "The Role of Temperature in Cement Hydration and Setting Time",
    "blogtext": "How Temperature Influences Cement Hydration Cement hydration is a temperature-dependent process. When temperatures are lower, hydration occurs more slowly, which affects setting time and overall project timelines. For contractors working in cold weather or those who need to accelerate the finishing process, understanding hydration and the"
  },
  {
    "id": 7,
    "blogimg": "/src/assets/img/Blogs8.png",
    "blogtitle": "How Weather and Finishing Techniques Affect Concrete Discoloration",
    "blogtext": "How Weather and Finishing Techniques Contribute to Concrete Discoloration Concrete discoloration is often spotty, inconsistent, or uneven, leaving surfaces with an unappealing look. This can be frustrating for contractors and homeowners expecting a smooth, uniform finish. While many factors can lead to discoloration, two of the"
  },
  {
    "id": 8,
    "blogimg": "/src/assets/img/Blogs9.png",
    "blogtitle": "Investigating and Preventing Concrete Discoloration",
    "blogtext": "Understanding Concrete Discoloration Concrete discoloration is a complex issue with many potential causes. Whether it appears immediately after placement or develops weeks or months later, identifying the source of discoloration is essential for finding the right solution. At Kennedy Concrete, we help contractors and homeowners pinpoint"
  },
  {
    "id": 9,
    "blogimg": "/src/assets/img/Blogs10.png",
    "blogtitle": "Kennedy Concrete at Touch-A-Truck Orlando",
    "blogtext": "Kennedy Concrete at Touch-A-Truck Orlando At Kennedy Concrete, we do more than just pour concrete, we help build the foundation of our communities. That’s why we were excited to be part of Touch-A-Truck Orlando, an event that gave kids and families a chance to get up"
  },
  {
    "id": 10,
    "blogimg": "/src/assets/img/Blogs11.png",
    "blogtitle": "How Blended Cements Improve Concrete Performance and Sustainability",
    "blogtext": "What Are Blended Cements? Blended cements are an alternative to ordinary Portland cement (OPC) that replace a portion of the clinker—the key binding component—with supplementary cementitious materials (SCMs). These materials improve the performance, sustainability, and durability of concrete while reducing its environmental impact. At Kennedy Concrete,"
  },
  {
    "id": 11,
    "blogimg": "/src/assets/img/blo.png",
    "blogtitle": "Building the Future Together: How Kennedy Concrete and Cemex Are Shaping Smarter, More Sustainable Concrete Solutions",
    "blogtext": "Building the Future Together: How Kennedy Concrete and Cemex Are Shaping Smarter, More Sustainable Concrete Solutions At Kennedy Concrete, we’ve always been focused on delivering high-quality, ready-mix concrete for small to mid-sized projects—ensuring that homeowners, contractors, and builders across Orlando, Tampa, and Brevard County receive the"
  },
  {
    "id": 12,
    "blogimg": "/src/assets/img/Blog12.png",
    "blogtitle": "How to Fix Concrete Discoloration and Prevent Future Issues",
    "blogtext": "Understanding Concrete Discoloration Concrete discoloration can be a frustrating issue, especially when it affects visible surfaces like driveways, sidewalks, patios, and polished concrete floors. When concrete appears uneven or blotchy, it can diminish the overall look of a project. Fortunately, there are effective ways to correct"
  },
  {
    "id": 13,
    "blogimg": "/src/assets/img/Blog13.png",
    "blogtitle": "Understanding and Preventing Concrete Stains",
    "blogtext": "How to Prevent and Address Concrete Stains What Are Concrete Stains? Concrete stains refer to discoloration or uneven coloring that can develop on the surface of concrete. While stains are often aesthetic in nature, they can detract from the visual appeal and perceived quality of the"
  },
  {
    "id": 14,
    "blogimg": "/src/assets/img/Blog14.png",
    "blogtitle": "Preventing Concrete Cracks During Curing",
    "blogtext": "Understanding and Preventing Concrete Cracks During Curing Why Do Concrete Cracks Happen? Concrete cracks are a common concern during the curing process. As concrete loses moisture and begins to harden, internal stresses can lead to cracking. These cracks often compromise the structure’s durability and appearance, making"
  },
  {
    "id": 15,
    "blogimg": "/src/assets/img/Blog15.png",
    "blogtitle": "Understanding the Role of Environmental Product Declarations",
    "blogtext": "The Importance of Environmental Product Declarations in Construction An Environmental Product Declaration (EPD) is a standardized, independently verified document that outlines the environmental impact of a specific product throughout its lifecycle. EPDs provide detailed data, enabling stakeholders in the construction industry to make informed, sustainability-focused decisions."
  },
  {
    "id": 16,
    "blogimg": "/src/assets/img/Blog16.jpg",
    "blogtitle": "Managing Hot Concrete Challenges in Florida’s Climate",
    "blogtext": "How to Manage Hot Concrete Challenges with Kennedy Concrete Hot concrete refers to the challenges faced when concrete is mixed, transported, and placed in high-temperature conditions. In Florida, these challenges are common due to the state’s warm climate, making proper preparation and handling essential for successful"
  },
  {
    "id": 17,
    "blogimg": "/src/assets/img/Blog17.png",
    "blogtitle": "Understanding and Preventing Drying Shrinkage Cracking in Concrete",
    "blogtext": "What Causes Drying Shrinkage Cracking and How to Prevent It Drying shrinkage cracking is a common issue in concrete, occurring as the material loses water over time. While all concrete shrinks during the drying process, it’s often restrained by factors such as: This restraint creates tension"
  },
  {
    "id": 18,
    "blogimg": "/src/assets/img/Blog18.png",
    "blogtitle": "Kennedy Concrete Delivers Building Materials for Construction",
    "blogtext": "Kennedy Concrete Delivers Building Materials for Construction At Kennedy Concrete, we’re known for delivering high-quality concrete, but our services go far beyond that. We also supply essential building materials for construction, ensuring you have everything needed to complete your project efficiently and on schedule. Whether you’re"
  },
  {
    "id": 19,
    "blogimg": "/src/assets/img/Blog19.png",
    "blogtitle": "Understanding the Benefits of Supplementary Cementitious Materials",
    "blogtext": "The Role of Supplementary Cementitious Materials in Modern Concrete Concrete is one of the most widely used materials in the world, but it comes with an environmental cost. Approximately 88% of the CO₂ emissions associated with a standard ready-mix concrete batch come from the cement. Supplementary"
  },
  {
    "id": 20,
    "blogimg": "/src/assets/img/Blog20.png",
    "blogtitle": "Challenges with Hot Weather Concreting and How to Overcome Them",
    "blogtext": "Understanding the Challenges of Hot Weather Concreting Hot weather concreting presents unique hurdles that can affect the success of your project. In Florida, high temperatures often lead to challenges such as slump loss, cracking, and shrinkage. Whether you’re working on a residential driveway or a large"
  },
  {
    "id": 21,
    "blogimg": "/src/assets/img/Blog21.png",
    "blogtitle": "Pouring Concrete Temperature: Best Practices for Florida’s Hot Weather",
    "blogtext": "Understanding Pouring Concrete Temperature Challenges In Florida, managing the temperature when pouring concrete is essential for a successful project. Pouring concrete temperature refers to the conditions under which concrete is mixed, transported, and placed in high heat. In Florida, temperatures above 85 degrees Fahrenheit are classified"
  },
  {
    "id": 22,
    "blogimg": "/src/assets/img/Blog22.png",
    "blogtitle": "Reliable Concrete Solutions for Every Project",
    "blogtext": "Reliable Concrete Solutions for Every Project At Kennedy Concrete, we know how important it is to have the right materials and support for your construction projects. Whether you’re a contractor or a DIY homeowner, our team is here to provide reliable concrete solutions tailored to your"
  },
  {
    "id": 23,
    "blogimg": "/src/assets/img/Blog23.png",
    "blogtitle": "Plan Ahead for Ready Mix Concrete Delivery",
    "blogtext": "Plan Ahead for Ready Mix Concrete Delivery Timely delivery of ready mix concrete is critical to the success of any construction project. At Kennedy Concrete, we understand the importance of delivering your materials on time so you can stay on schedule and keep your project running"
  },
  {
    "id": 24,
    "blogimg": "/src/assets/img/Blog24.png",
    "blogtitle": "Fast and Reliable Ready Mix Concrete Delivery",
    "blogtext": "Fast and Reliable Ready Mix Concrete Delivery When it comes to construction projects, having a trusted partner for ready mix concrete delivery can make all the difference. At Kennedy Concrete, we’ve made the process simple and stress-free to ensure your projects stay on track. Whether you’re"
  },
  {
    "id": 25,
    "blogimg": "/src/assets/img/Blog25.png",
    "blogtitle": "Kennedy Concrete Is Your Go-To Ready Mix Supplier",
    "blogtext": "Kennedy Concrete Is Your Go-To Ready Mix Supplier At Kennedy Concrete, we understand how crucial it is to have a reliable partner for your concrete needs. As your go-to ready mix supplier, we’re here to make your ordering process seamless, ensuring your projects stay on track"
  },
  {
    "id": 26,
    "blogimg": "/src/assets/img/Blog26.png",
    "blogtitle": "How Kennedy Concrete Repairs Cracks in Concrete",
    "blogtext": "How Kennedy Concrete Repairs Cracks in Concrete Concrete is one of the most durable building materials, but cracks are a natural part of its lifecycle. At Kennedy Concrete, we specialize in identifying and repairing these cracks, ensuring your project stays strong and reliable for years to"
  },
  {
    "id": 27,
    "blogimg": "/src/assets/img/Blog27.png",
    "blogtitle": "Kennedy Concrete Provides Building Materials For Sale",
    "blogtext": "Kennedy Concrete Provides Building Materials For Sale Looking for high-quality building materials for sale? At Kennedy Concrete, we have the tools, expertise, and materials to support projects of every size—from small backyard builds to large-scale commercial developments. Your Source for Premium Construction Materials Kennedy Concrete offers"
  },
  {
    "id": 28,
    "blogimg": "/src/assets/img/Blog28.png",
    "blogtitle": "Choosing the Right Concrete PSI for Your Project",
    "blogtext": "Choosing the Right Concrete PSI for Your Project Understanding concrete PSI is essential for ensuring your project has the strength and durability it needs. PSI, or pounds per square inch, measures the compressive strength of concrete and determines how much weight it can support before breaking."
  },
  {
    "id": 29,
    "blogimg": "/src/assets/img/Blog29.png",
    "blogtitle": "How Kennedy Concrete Helps Manage Cracks in Concrete",
    "blogtext": "How Kennedy Concrete Helps Manage Cracks in Concrete As Sammy Palacios from Kennedy Concrete Orlando says, “There are taxes, death, and cracks—you can’t live without them.” While cracks in concrete can’t be entirely eliminated, they can be minimized with the right materials, techniques, and guidance. Why"
  },
  {
    "id": 30,
    "blogimg": "/src/assets/img/Blogs30.png",
    "blogtitle": "How Kennedy Concrete Uses the Concrete Slump Test for Reliable Results",
    "blogtext": "How Kennedy Concrete Uses the Slump Test for Reliable Results The concrete slump test is a simple yet vital tool to measure the consistency and workability of concrete. At Kennedy Concrete, we use this test to ensure that every mix we provide meets the specific needs"
  },
  {
    "id": 41,
    "blogimg": "/src/assets/img/Blog41.png",
    "blogtitle": "Kennedy Concrete Expands Building Material Offerings in 2025",
    "blogtext": "Kennedy Concrete Expands Building Material Offerings in 2025 Kennedy Concrete is excited to announce an expansion of our building material offerings in 2025, making it easier than ever to tackle a wide range of projects. With the addition of rebar and block to our lineup, we’re"
  },
  {
    "id": 42,
    "blogimg": "/src/assets/img/Blog42.png",
    "blogtitle": "Kennedy Concrete Launches New Virtual Storefront for Easy Online Ordering of Ready-Mix Concrete and Building Materials",
    "blogtext": "Kennedy Concrete Launches New Virtual Storefront for Easy Online Ordering of Ready-Mix Concrete and Building Materials If you’re searching for a better way to buy concrete, Kennedy Concrete’s newly enhanced Virtual Storefront is here to make ordering concrete fast, easy, and convenient. The latest version of this online"
  },
  {
    "id": 43,
    "blogimg": "/src/assets/img/Blog43.png",
    "blogtitle": "Concrete Foundation Pour for Aircraft Hangar",
    "blogtext": "Concrete Foundation Pour for Aircraft Hangar At Kennedy Concrete, we specialize in providing high-quality concrete solutions for a variety of projects—from small residential pours to large-scale commercial builds. Recently, we had the pleasure of working with JBN Specialty Concrete Services on a concrete foundation pour for"
  },
  {
    "id": 44,
    "blogimg": "/src/assets/img/Blog44.png",
    "blogtitle": "Meet “Rocky” – Your AI Concrete Expert at Kennedy Concrete",
    "blogtext": "Meet “Rocky” – Your AI Concrete Expert At Kennedy Concrete, we’re always striving to bring the best service to our customers—whether you’re a seasoned contractor or a homeowner tackling a DIY project. That’s why we’re excited to introduce Rocky, our new AI-powered concrete expert, ready to assist"
  },
  {
    "id": 45,
    "blogimg": "/src/assets/img/Blog45.png",
    "blogtitle": "Find Concrete Pump Companies & Finishers for Your Project",
    "blogtext": "Find Concrete Pump Companies & Finishers for Your Project At Kennedy Concrete, we know that completing a project often requires more than just high-quality concrete. Whether you’re a contractor or a homeowner, you might need additional professional help to bring your vision to life. We’re here"
  },
  {
    "id": 46,
    "blogimg": "/src/assets/img/Blog46.png",
    "blogtitle": "How to Order Concrete with Kennedy Concrete",
    "blogtext": "How to Order Concrete with Kennedy Concrete  When it comes to construction, timing and precision matter. Ordering concrete for your project shouldn’t be complicated. At Kennedy Concrete, we make it easy to place your order, whether you’re a first-time buyer or an experienced contractor. Our options"
  },
  {
    "id": 47,
    "blogimg": "/src/assets/img/Blog47.png",
    "blogtitle": "Kennedy Concrete Delivers 700-Yard Pour for U-Haul in Titusville",
    "blogtext": "Kennedy Concrete Delivers 700-Yard Pour for U-Haul in Titusville At Kennedy Concrete, we take pride in being the go-to partner for reliable concrete deliveries, no matter the scale. Our recent 700-yard pour for U-Haul in Titusville, Florida, shows our commitment to efficiency and precision. Partnering with"
  },
  {
    "id": 48,
    "blogimg": "/src/assets/img/Blog48.png",
    "blogtitle": "Kennedy Concrete Reopens Titusville Plant ",
    "blogtext": "We’re excited to share some big news for Brevard County! Kennedy Concrete has officially reopened its Titusville plant, located on the north side of Brevard County. After years of being shut down, this facility is back in action, ready to serve the local construction community with"
  },
  {
    "id": 49,
    "blogimg": "/src/assets/img/Blog49.png",
    "blogtitle": "Kennedy Concrete Orlando Names Sammy Palacios as General Manager",
    "blogtext": "Kennedy Concrete Orlando Names Sammy Palacios as General Manager Kennedy Concrete is pleased to announce the appointment of Sammy Palacios as the new General Manager of its Orlando market. Sammy will be succeeding longtime GM Sam McKinley, who has been instrumental in shaping the company’s success"
  },
  {
    "id": 50,
    "blogimg": "/src/assets/img/Blog50.png",
    "blogtitle": "Supporting Tampa’s Local Businesses with Quality Concrete",
    "blogtext": "Supporting Tampa’s Local Businesses with Quality Concrete Kennedy Concrete proudly supports local businesses across the Tampa Bay area. Recently, we wrapped up a small commercial job for our good friend Salem, owner of Salem’s Fresh Eats, a popular restaurant chain in Tampa. We provided high-quality ready-mix"
  }
]
